<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $permissions = [
            //مقالات
            'مقالات-عرض',
            'مقالات-انشاء',
            'مقالات-تعديل',
            'مقالات-حذف',
            //اقسام
            'أقسام-عرض',
            'أقسام-انشاء',
            'أقسام-تعديل',
            'أقسام-حذف',
            //وسوم
            'وسوم-عرض',
            'وسوم-انشاء',
            'وسوم-تعديل',
            'وسوم-حذف',
            //  اسئلة شائعة
            'اسئلة شائعة-عرض',
            'اسئلة شائعة-انشاء',
            'اسئلة شائعة-تعديل',
            'اسئلة شائعة-حذف',
            //صلاحيات
            'صلاحيات-عرض',
            'صلاحيات-رؤيا',
            'صلاحيات-انشاء',
            'صلاحيات-تعديل',
            'صلاحيات-حذف',
            // مشرفين
            'مشرفين-عرض',
            'مشرفين-انشاء',
            'مشرفين-تعديل',
            'مشرفين-حذف',
            //صفحات الثابتة
            'صفحات الثابتة-عرض',
            'صفحات الثابتة-انشاء',
            'صفحات الثابتة-رؤيا',
            'صفحات الثابتة-تعديل',
            'صفحات الثابتة-حذف',
          
            //طلبات التواصل
            "طلبات التواصل",
            "طلبات التواصل-عرض",
            "طلبات التواصل-حذف",
            //اعدادات الموقع
            "اعدادات الموقع",
            "اعدادات الموقع-تعديل",
        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission, 'guard_name' => 'admin']);
        }
    }
}
